Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "XL2400T.h"
#include "rf_xl2400.h"
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "stm32c0xx_hal_flash.h"
#include "stm32c0xx_hal_flash_ex.h"

/* 中文注释：
   - XL2400T.h 与 rf_xl2400.h 提供 2.4GHz RF 模块初始化、发送、接收接口
   - 采用 900ms 周期同步协议：0-450ms 发送同步包，450-900ms 接收同步包
   - LED 指示：PB6 (LED_Pin) 同步事件指示 + PA2 (LED_DRV_Pin) PWM 驱动
*/
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define SYNC_CYCLE_MS       900U    /* 同步周期 900ms */
#define SYNC_LED_ON_MS      100U    /* LED 亮灯时间 100ms */
#define SYNC_TX_TIME_MS     450U    /* TX 发送时间：所有节点固定 450ms */
#define SYNC_TX_DELAY_MS    6U      /* 传输延迟补偿 */
#define SYNC_PKT_SIZE       4U      /* AA 55 + 2字节相位 */
#define RF_TX_CHANNEL       76U     /* XL2400T TX 频道 76 (2476 MHz) */
#define RF_RX_CHANNEL       75U     /* XL2400T RX 频道 75 (2475 MHz) - 相邻频道避免自干扰 */

/* RF 链路测试模式（先简后繁）：
 * - RX-only：循环 PollReceive，收到后打印/点亮 LED
 * - TX-only：循环周期性 Send 同步包（AA55 + 相位）
 * 你需要把角色宏切成不同编译即可得到 TX/RX 两个程序。
 */
#define APP_RF_LINK_TEST  1
#define APP_ROLE_RX_ONLY  1
#define APP_ROLE_TX_ONLY  0

/* 仅允许启用一个角色 */
#if (APP_ROLE_RX_ONLY + APP_ROLE_TX_ONLY) != 1
#error "APP_ROLE_RX_ONLY / APP_ROLE_TX_ONLY must enable exactly one role"
#endif

/* 临时灯光控制包（先测收发/解析，不上真正业务字段复杂度） */
/* 协议（8字节负载）：
 * byte0=0xAA, byte1=0x55  : 帧头
 * byte2=mode(1~7)        : 灯光模式号
 * byte3=bright(0~2)     : 亮度档位（0=30%, 1=70%, 2=100%）
 * byte4..byte7=0        : 预留（先不做 ID/校验）
 */
#define TLIGHT_PKT_HEADER0 0xAA
#define TLIGHT_PKT_HEADER1 0x55
#define TLIGHT_MODE_OFF     0U
#define TLIGHT_MODE_MIN     1U
#define TLIGHT_MODE_MAX     7U

#define TLIGHT_BRIGHT_30    0U
#define TLIGHT_BRIGHT_70    1U
#define TLIGHT_BRIGHT_100   2U

/* 临时协议扩展：加入按键来源/触发类型与序号，便于联调观察 */
#define TLIGHT_PKT_KEYTRIG_IDX    4U  /* bit7..6=key, bit5..4=trig, bit3..0=seq4 */
#define TLIGHT_PKT_DEV_ID_L_IDX   5U
#define TLIGHT_PKT_DEV_ID_H_IDX   6U
#define TLIGHT_PKT_CHKSUM_IDX     7U
#define TLIGHT_PKT_TAG_IDX        8U
#define TLIGHT_PKT_TAG_CONST      0x5AU

#define TLIGHT_KEY_NONE           3U
#define TLIGHT_KEY_L              0U
#define TLIGHT_KEY_M              1U
#define TLIGHT_KEY_R              2U

#define TLIGHT_TRIG_NONE          0U
#define TLIGHT_TRIG_SINGLE        1U
#define TLIGHT_TRIG_DOUBLE        2U
#define TLIGHT_TRIG_LONG          3U

/* P1：设备ID（单向链路唯一性）
 * - TX 发送自己的设备ID
 * - RX 仅接收与本机已配对ID一致的数据包
 * 当前 8 字节包先使用 8-bit ID；后续若扩展 16-bit，可在 v1.1 增长包长度。 */
#define TLIGHT_DEVICE_ID_DEFAULT   0x2A2AU
#define TLIGHT_DEVICE_ID_INVALID   0x0000U

/* 对码流程（正式版） */
#define PAIRING_MODE_TIMEOUT_MS 5000U

/* 设备ID持久化（Flash 最后一页）
 * 说明：这是“对码流程骨架”实现。量产时建议在链接脚本明确预留参数页，避免与程序区冲突。 */
#define DEVCFG_MAGIC0              0xD1U
#define DEVCFG_MAGIC1              0xA5U
#define DEVCFG_VERSION             0x01U
#define DEVCFG_FLASH_ADDR          (FLASH_BASE + FLASH_SIZE - FLASH_PAGE_SIZE)
#define DEVCFG_FLASH_PAGE          (FLASH_PAGE_NB - 1U)

#define TLIGHT_MODE_SWITCH_INTERVAL_MS 2000U
#define LINK_RX_TIMEOUT_MS           1200U  /* 超过 1.2s 未收到有效包，判定链路超时 */
#define LINK_STATS_LOG_INTERVAL_MS   3000U  /* 每 3s 打印一次统计，避免刷屏 */
#define UART_CMD_BUF_SIZE            48U

/* TX 发包策略：按键事件触发短突发；对码窗口内才周期发 */
#define LINK_TX_EVENT_BURST_COUNT    4U
#define LINK_TX_BURST_INTERVAL_MS    40U
#define LINK_TX_PAIRING_INTERVAL_MS  120U
#define RF_TX_WAKEUP_SETTLE_MS       2U
#define RF_TX_BOOT_WARM_MS           1500U
#define LINK_TX_BOOT_BURST_COUNT     6U

/* 简化可见指示（用 LED_Pin，不做真实 LM3409 PWM 还原） */
#define LED_FLASH_PERIOD_MS  250U   /* 闪烁周期 */
#define LED_BREATH_PERIOD_MS 800U   /* 呼吸周期（简化为慢速占空） */


#define DEBUG_ADC_VERBOSE  0   /* 调试：1=打印 ADC 采样值，完成后可改为 0 精简 */
#define DEBUG_SYNC_VERBOSE 1   /* 调试：1=打印详细同步信息，0=只打印关键事件 */
#define DEBUG_LED_VERBOSE  1   /* 调试：1=打印LED状态，0=不打印 */
#define DEBUG_PERIODIC     0   /* 调试：1=启用定期打印（影响功耗），0=禁用 */
#define UART_LOG_ENABLE    1   /* 串口日志总开关：1=开启打印，0=关闭打印（先用于排查波形） */
#define RX_LOCAL_EFFECT_TEST  1U  /* RX本地灯效测试：1=忽略RF命令并按本地脚本切模式 */
#define RX_LOCAL_STEP_MS      8000U /* 本地测试每个模式驻留时间 */
#define RX_LOCAL_TEST_BRIGHT  TLIGHT_BRIGHT_70 /* 本地测试亮度：70% 便于观察PWM相位锁定 */

/* 按键对码（L=PB7, R=PA1，内部下拉，按下为高） */
#define KEY_ACTIVE_LEVEL        GPIO_PIN_SET
#define KEY_DEBOUNCE_MS         20U
#define KEY_LONG_MS             2000U

/* TX 三键熄灯/点亮规则（v0.3.3） */
#define KEY_TX_LONG_MS          1000U
#define KEY_TX_DBL_MS           700U
#define KEY_TX_TAP_MAX_MS       320U
#define KEY_TX_DOUBLE_ENABLE    0U
#define TX_KEY_LED_ON_MS        180U

/* TX 右键本地调试（积木化排查）
 * 1: 仅测试右键 single/double/long 的识别与 LED 反馈，不走业务发送
 * 0: 关闭调试，恢复正常业务逻辑 */
#define TX_KEY_R_DEBUG_ONLY     0U
#define RDBG_LED_STEP_MS        500U
#define RDBG_LED_DBL_HOLD_MS    2000U

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim14;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
static uint8_t RF_TX_Buf[RF_PACKET_SIZE]   = {0};
static uint8_t RF_RX_Buf[RF_PACKET_SIZE]   = {0};

static uint32_t g_cycle = 0;
static uint16_t g_phase_ms = 0;
static uint32_t g_last_tick_ms = 0;
static uint32_t g_last_tx_cycle = (uint32_t)-1;

static uint8_t  g_rf_mode = 0;
static uint8_t  g_led_state = 0;
static uint32_t g_led_on_tick = 0;

static uint8_t  g_is_night = 1;
static uint32_t g_last_daynight_tick = 0;
static uint32_t g_daynight_hold_until_tick = 0;

