Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
static uint32_t g_last_charge_tick = 0;

static uint8_t  g_rf_sleeping = 0;
static uint8_t  g_rf_sleeping_night = 0;
static uint32_t g_adc_display_tick = 0;  /* ADC显示计时器 */

/* 链路调试统计（用于串口观测通信质量） */
static uint8_t  g_link_tx_seq = 0;
static uint8_t  g_link_last_rx_seq = 0;
static uint8_t  g_tx_last_key = TLIGHT_KEY_NONE;
static uint8_t  g_tx_last_trig = TLIGHT_TRIG_NONE;
static uint8_t  g_link_has_last_seq = 0;
static uint32_t g_link_tx_ok = 0;
static uint32_t g_link_tx_fail = 0;
static uint32_t g_link_rx_ok = 0;
static uint32_t g_link_rx_parse_err = 0;
static uint32_t g_link_rx_dev_mismatch = 0;
static uint32_t g_link_rx_dup = 0;
static uint32_t g_link_rx_jump = 0;
static uint8_t  g_link_timeout_flag = 0;
static uint32_t g_link_last_rx_tick = 0;
static uint32_t g_link_last_stats_tick = 0;
static uint32_t g_link_last_log_tx_ok = 0;
static uint32_t g_link_last_log_tx_fail = 0;
static uint8_t  g_link_last_log_tx_awake = 0xFFU;

/* 设备ID运行态（来自 Flash，16-bit） */
static uint16_t g_dev_id_local = TLIGHT_DEVICE_ID_DEFAULT;
static uint16_t g_dev_id_paired = TLIGHT_DEVICE_ID_DEFAULT;

/* 串口命令缓存（P1 临时对码入口） */
static char g_uart_cmd_buf[UART_CMD_BUF_SIZE] = {0};
static uint8_t g_uart_cmd_len = 0;

/* 按键状态（L/R 组合键进入对码） */
static uint8_t  g_pair_last_raw = 0U;
static uint8_t  g_pair_stable = 0U;
static uint8_t  g_pair_long_done = 0U;
static uint32_t g_pair_raw_change_tick = 0;
static uint32_t g_pair_press_start_tick = 0;

/* 正式对码流程状态 */
static uint8_t  g_pairing_mode = 0U;
static uint32_t g_pairing_enter_tick = 0U;
static uint32_t g_pair_led_tick = 0U;

/* TX 三键事件（由按键状态机在主循环生成） */
static volatile uint8_t g_tx_evt_l = 0U;
static volatile uint8_t g_tx_evt_m = 0U;
static volatile uint8_t g_tx_evt_r = 0U;

/* TX 按键识别状态（单击/双击/长按） */
typedef struct {
  uint8_t  stable_level;
  uint8_t  last_raw;
  uint32_t raw_change_tick;
  uint32_t press_start_tick;
  uint32_t last_press_duration_ms;
  uint8_t  long_reported;
  uint8_t  click_pending;
  uint32_t first_click_tick;
} TxKeyState_t;

static TxKeyState_t g_txk_l = {0};
static TxKeyState_t g_txk_m = {0};
static TxKeyState_t g_txk_r = {0};

/* TX 业务态（按功能说明书语义） */
static uint8_t g_tx_mode = TLIGHT_MODE_MIN;
static uint8_t g_tx_bright = TLIGHT_BRIGHT_30;
static uint8_t g_tx_basic_mode = TLIGHT_MODE_MIN;  /* 1..3 */
static uint8_t g_tx_effect_mode = 4U;              /* 4..7 */
static uint8_t g_tx_in_effect = 0U;
static uint8_t g_tx_is_off = 0U;
static uint8_t g_tx_left_all_on_armed = 0U;
static uint8_t g_tx_need_send = 0U;
static uint8_t g_tx_burst_left = 0U;
static uint32_t g_tx_last_send_tick = 0U;
static uint8_t g_tx_rf_awake = 1U;
static uint32_t g_tx_rf_wakeup_tick = 0U;
static uint8_t g_tx_boot_warm_done = 0U;
static uint32_t g_tx_boot_warm_until = 0U;
static uint8_t g_tx_first_event_done = 0U;

#if APP_ROLE_TX_ONLY
static uint8_t g_rdbg_evt_single = 0U;
static uint8_t g_rdbg_evt_double = 0U;
static uint8_t g_rdbg_evt_long = 0U;
static uint32_t g_rdbg_single_cnt = 0U;
static uint32_t g_rdbg_double_cnt = 0U;
static uint32_t g_rdbg_long_cnt = 0U;

typedef enum {
  RDBG_LED_IDLE = 0,
  RDBG_LED_SINGLE_ON,
  RDBG_LED_LONG_ON,
  RDBG_LED_LONG_OFF,
  RDBG_LED_DBL_HOLD
} RdbgLedState_t;

static RdbgLedState_t g_rdbg_led_state = RDBG_LED_IDLE;
static uint32_t g_rdbg_led_mark = 0U;
static uint8_t g_rdbg_led_long_remain = 0U;
#endif

/* 双路 PWM 灯效状态（RX-only） */
static uint8_t g_light_mode = TLIGHT_MODE_MIN;
static uint8_t g_light_bright = TLIGHT_BRIGHT_30;

/* 相位锁定节拍（1ms） */
static volatile uint16_t g_phase_1ms = 0U;

/* 夜间初期双通道采样调试 */
static uint32_t g_night_start_tick = 0;     /* 夜间开始时间 */
static uint8_t  g_night_debug_window = 0;   /* 是否在调试窗口内（夜间开始后6秒） */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM14_Init(void);
/* USER CODE BEGIN PFP */
static void DebugPrint(const char *s);
static void DebugPrintHex(const uint8_t *buf, uint8_t len);
static void DebugPrintDec(uint16_t val);
static void SyncTime_Update(void);
static void SyncLamp_Update(void);
static void BuildSyncPacket(uint8_t *pkt);
static uint16_t ParseSyncPacket(const uint8_t *pkt);
static void BuildTempLightPacket(uint8_t *pkt, uint8_t mode, uint8_t bright, uint8_t key, uint8_t trig);
static uint8_t ParseTempLightPacket(const uint8_t *pkt, uint8_t *mode, uint8_t *bright, uint8_t *key, uint8_t *trig);
static uint8_t TempLight_CalcChecksum(const uint8_t *pkt);
static uint8_t DevId_CalcCrc8(const uint8_t *buf, uint8_t len);
static uint16_t DevId_FromUid(void);
static void DevId_LoadFromFlash(void);
static uint8_t DevId_SaveToFlash(uint16_t local_id, uint16_t paired_id);
static void UartCmd_Poll(void);
static void UartCmd_HandleLine(const char *line);
static void KeyPairing_Poll(uint32_t now);
static void LinkStats_Log(uint32_t now);
static void Sync_AdjustFromPacket(uint16_t rx_phase_ms);
static void Sync_MainLoop(void);
static void Light_Tick(uint32_t now);
static void PairingLed_Update(uint32_t now);
static void PairingLed_Feedback(uint8_t success);
static void TxKeys_Process(uint32_t now);
static void TxKeyR_DebugLedTask(uint32_t now);
static uint16_t GetPhase1ms(uint16_t period_ms);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

typedef struct {
  uint8_t magic0;
  uint8_t magic1;
  uint8_t version;
  uint8_t local_id_l;
  uint8_t local_id_h;
  uint8_t paired_id_l;
  uint8_t paired_id_h;
  uint8_t crc8;
  uint8_t tail;
  uint8_t reserved[7];
} DevCfg_t;

static uint8_t DevId_CalcCrc8(const uint8_t *buf, uint8_t len)
{
  uint8_t x = 0;
  uint8_t i = 0;
  for (i = 0; i < len; i++) {
    x ^= buf[i];
  }
  return x;
}

static uint16_t DevId_FromUid(void)
{
  const uint32_t *uid = (const uint32_t *)UID_BASE;
  uint32_t mix = uid[0] ^ uid[1] ^ uid[2];
  mix ^= (mix >> 16);
  uint16_t id = (uint16_t)(mix & 0xFFFFU);
  if (id == TLIGHT_DEVICE_ID_INVALID) {
    id = TLIGHT_DEVICE_ID_DEFAULT;
  }
  return id;
}

static void DevId_LoadFromFlash(void)
{
  const DevCfg_t *cfg = (const DevCfg_t *)DEVCFG_FLASH_ADDR;
  uint8_t calc = DevId_CalcCrc8((const uint8_t *)cfg, 7U);
  uint16_t local_id = (uint16_t)((cfg->local_id_h << 8) | cfg->local_id_l);
  uint16_t paired_id = (uint16_t)((cfg->paired_id_h << 8) | cfg->paired_id_l);

