Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  if ((cfg->magic0 == DEVCFG_MAGIC0) &&
      (cfg->magic1 == DEVCFG_MAGIC1) &&
      (cfg->version == DEVCFG_VERSION) &&
      (cfg->tail == TLIGHT_PKT_TAG_CONST) &&
      (local_id != TLIGHT_DEVICE_ID_INVALID) &&
      (paired_id != TLIGHT_DEVICE_ID_INVALID) &&
      (cfg->crc8 == calc)) {
    g_dev_id_local = local_id;
    g_dev_id_paired = paired_id;
    return;
  }

  /* Flash 未初始化或损坏：使用 UID 派生默认ID并回写一次 */
  g_dev_id_local = DevId_FromUid();
  g_dev_id_paired = g_dev_id_local;
  (void)DevId_SaveToFlash(g_dev_id_local, g_dev_id_paired);
}

static uint8_t DevId_SaveToFlash(uint16_t local_id, uint16_t paired_id)
{
  FLASH_EraseInitTypeDef erase = {0};
  uint32_t page_error = 0;
  DevCfg_t cfg;
  uint64_t row0 = 0;
  uint64_t row1 = 0;

  if ((local_id == TLIGHT_DEVICE_ID_INVALID) || (paired_id == TLIGHT_DEVICE_ID_INVALID)) {
    return 0;
  }

  memset(&cfg, 0, sizeof(cfg));
  cfg.magic0 = DEVCFG_MAGIC0;
  cfg.magic1 = DEVCFG_MAGIC1;
  cfg.version = DEVCFG_VERSION;
  cfg.local_id_l = (uint8_t)(local_id & 0xFFU);
  cfg.local_id_h = (uint8_t)(local_id >> 8);
  cfg.paired_id_l = (uint8_t)(paired_id & 0xFFU);
  cfg.paired_id_h = (uint8_t)(paired_id >> 8);
  cfg.crc8 = DevId_CalcCrc8((const uint8_t *)&cfg, 7U);
  cfg.tail = TLIGHT_PKT_TAG_CONST;

  memcpy(&row0, &cfg, sizeof(row0));
  memcpy(&row1, ((const uint8_t *)&cfg) + sizeof(row0), sizeof(row1));

  HAL_FLASH_Unlock();

  erase.TypeErase = FLASH_TYPEERASE_PAGES;
  erase.Page = DEVCFG_FLASH_PAGE;
  erase.NbPages = 1;
  if (HAL_FLASHEx_Erase(&erase, &page_error) != HAL_OK) {
    HAL_FLASH_Lock();
    return 0;
  }

  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, DEVCFG_FLASH_ADDR, row0) != HAL_OK) {
    HAL_FLASH_Lock();
    return 0;
  }

  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, DEVCFG_FLASH_ADDR + 8U, row1) != HAL_OK) {
    HAL_FLASH_Lock();
    return 0;
  }

  HAL_FLASH_Lock();

  g_dev_id_local = local_id;
  g_dev_id_paired = paired_id;
  return 1;
}

static void UartCmd_HandleLine(const char *line)
{
  unsigned long v = 0;

  if ((line[0] == '\0') || (line[0] == '\r') || (line[0] == '\n')) {
    return;
  }

  if ((strcmp(line, "HELP") == 0) || (strcmp(line, "help") == 0)) {
    DebugPrint("[CMD] HELP/ID?/PAIR?/ID <1..65535>/PAIR <1..65535>\r\n");
    return;
  }

  if ((strcmp(line, "ID?") == 0) || (strcmp(line, "id?") == 0)) {
    DebugPrint("[CMD] ID=");
    DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
    DebugPrint("\r\n");
    return;
  }

  if ((strcmp(line, "PAIR?") == 0) || (strcmp(line, "pair?") == 0)) {
    DebugPrint("[CMD] PAIRED=");
    DebugPrintHex((const uint8_t *)&g_dev_id_paired, 2);
    DebugPrint("\r\n");
    return;
  }

  if ((strncmp(line, "ID ", 3) == 0) || (strncmp(line, "id ", 3) == 0)) {
    v = strtoul(&line[3], NULL, 10);
    if ((v >= 1UL) && (v <= 65535UL)) {
      if (DevId_SaveToFlash((uint16_t)v, g_dev_id_paired)) {
        DebugPrint("[CMD] ID saved: ");
        DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
        DebugPrint("\r\n");
      } else {
        DebugPrint("[CMD-ERR] ID save fail\r\n");
      }
    } else {
      DebugPrint("[CMD-ERR] ID range 1..65535\r\n");
    }
    return;
  }

  if ((strncmp(line, "PAIR ", 5) == 0) || (strncmp(line, "pair ", 5) == 0)) {
    v = strtoul(&line[5], NULL, 10);
    if ((v >= 1UL) && (v <= 65535UL)) {
      if (DevId_SaveToFlash(g_dev_id_local, (uint16_t)v)) {
        DebugPrint("[CMD] PAIRED saved: ");
        DebugPrintHex((const uint8_t *)&g_dev_id_paired, 2);
        DebugPrint("\r\n");
      } else {
        DebugPrint("[CMD-ERR] PAIRED save fail\r\n");
      }
    } else {
      DebugPrint("[CMD-ERR] PAIR range 1..65535\r\n");
    }
    return;
  }

  DebugPrint("[CMD-ERR] Unknown. use HELP\r\n");
}

static void UartCmd_Poll(void)
{
  uint8_t ch = 0;

  while (HAL_UART_Receive(&huart1, &ch, 1, 0) == HAL_OK) {
    /* 回显，便于确认命令确实被固件接收到了 */
    HAL_UART_Transmit(&huart1, &ch, 1, 20);

    if ((ch == '\r') || (ch == '\n')) {
      DebugPrint("\r\n");
      g_uart_cmd_buf[g_uart_cmd_len] = '\0';
      UartCmd_HandleLine(g_uart_cmd_buf);
      g_uart_cmd_len = 0;
      continue;
    }

    if ((ch >= 32U) && (ch <= 126U)) {
      if (g_uart_cmd_len < (UART_CMD_BUF_SIZE - 1U)) {
        g_uart_cmd_buf[g_uart_cmd_len++] = (char)ch;
      } else {
        g_uart_cmd_len = 0;
        DebugPrint("[CMD-ERR] too long\r\n");
      }
    }
  }
}

static void KeyPairing_Poll(uint32_t now)
{
  uint8_t l_raw = (HAL_GPIO_ReadPin(L_KEY_GPIO_Port, L_KEY_Pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t r_raw = (HAL_GPIO_ReadPin(R_KEY_GPIO_Port, R_KEY_Pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t raw = (l_raw && r_raw) ? 1U : 0U;

  /* 退出对码超时（TX/RX 通用） */
  if ((g_pairing_mode != 0U) && ((now - g_pairing_enter_tick) >= PAIRING_MODE_TIMEOUT_MS)) {
    g_pairing_mode = 0U;
    g_pairing_enter_tick = 0U;
    DebugPrint("[PAIR] timeout\r\n");
#if APP_ROLE_TX_ONLY
    /* TX 对码超时指示：长亮 500ms（反馈期间独占 LED） */
    PairingLed_Feedback(0U);
#endif
  }

#if APP_ROLE_TX_ONLY
  if ((g_pairing_mode == 0U) && (raw == 0U)) {
    return;
  }

  if (raw != g_pair_last_raw) {
    g_pair_last_raw = raw;
    g_pair_raw_change_tick = now;
  }

  if ((now - g_pair_raw_change_tick) < KEY_DEBOUNCE_MS) {
    return;
  }

  if (raw != g_pair_stable) {
    g_pair_stable = raw;

    DebugPrint("[KEY] L=");
    DebugPrintDec((uint16_t)l_raw);
    DebugPrint(" R=");
    DebugPrintDec((uint16_t)r_raw);
    DebugPrint(" LR=");
    DebugPrintDec((uint16_t)raw);
    DebugPrint("\r\n");

    if (g_pair_stable == 1U) {
      g_pair_press_start_tick = now;
      g_pair_long_done = 0U;
      DebugPrint("[PAIR] LR down\r\n");
    } else {
      g_pair_press_start_tick = 0U;
      g_pair_long_done = 0U;
      DebugPrint("[PAIR] LR up\r\n");
    }
  }

  if ((g_pair_stable == 1U) && (g_pair_long_done == 0U) && (g_pair_press_start_tick != 0U)) {
    uint32_t held = now - g_pair_press_start_tick;

    if (held >= KEY_LONG_MS) {
      g_pairing_mode = 1U;
      g_pairing_enter_tick = now;
      g_pair_led_tick = now;
      DebugPrint("[PAIR] enter (tx)\r\n");
      g_pair_long_done = 1U;
      g_tx_need_send = 1U;
    }
  }
#else
  (void)l_raw;
  (void)r_raw;
  (void)raw;
#endif
}

