Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM1_Init();
  MX_USART1_UART_Init();
  MX_TIM14_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_Base_Start_IT(&htim14);
  DevId_LoadFromFlash();
  DebugPrint("[FW] " FW_VERSION "\r\n");
  DebugPrint("[DEV] local=");
  DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
  DebugPrint(" paired=");
  DebugPrintHex((const uint8_t *)&g_dev_id_paired, 2);
  DebugPrint("\r\n");
  DebugPrint("[CMD] type HELP\r\n");

#if APP_ROLE_TX_ONLY
  /* TX 上电自检：LED 快闪 1 次 */
  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
  HAL_Delay(70);
  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
#endif

  /* 原 PA3=BOOST_EN 已改为 PWM2（TIM1_CH4 / LED_DRV2_Pin），不再控制升压使能 */
  HAL_Delay(100);

  /* 两路 PWM 启动（PA2=TIM1_CH3, PA3=TIM1_CH4） */
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

  /* 使能CCR预装载：比较值在更新事件统一生效，减少交替模式边沿毛刺 */
  __HAL_TIM_ENABLE_OCxPRELOAD(&htim1, TIM_CHANNEL_3);
  __HAL_TIM_ENABLE_OCxPRELOAD(&htim1, TIM_CHANNEL_4);

  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 0);



#if APP_ROLE_TX_ONLY && TX_KEY_R_DEBUG_ONLY
  DebugPrint("RF Bypass (R-key debug only)\r\n");
#else
    /* RF 模块初始化 */
  DebugPrint("RF Init...\r\n");
  RF_Link_Init();
  DebugPrint("RF Init OK\r\n");

#if APP_RF_LINK_TEST && APP_ROLE_RX_ONLY
  /* 链路测试：RX-only */
  DebugPrint("RF Config RX...\r\n");
  RF_Link_ConfigRx(RF_RX_CHANNEL);
  g_rf_mode = 0;
#elif APP_RF_LINK_TEST && APP_ROLE_TX_ONLY
  /* 链路测试：TX-only，上电保温一段时间后再进入休眠策略 */
  DebugPrint("RF Config TX...\r\n");
  RF_Link_ConfigTx(RF_TX_CHANNEL);
  g_rf_mode = 1;
  g_tx_rf_awake = 1U;
  g_tx_rf_wakeup_tick = HAL_GetTick();
  g_tx_boot_warm_done = 0U;
  g_tx_boot_warm_until = HAL_GetTick() + RF_TX_BOOT_WARM_MS;
  g_tx_first_event_done = 0U;
  DebugPrint("[RF] TX warm@boot\r\n");
#else
  /* 默认进入 RX 模式，监听频道 75（保持原 demo 行为） */
  DebugPrint("RF Config RX...\r\n");
  RF_Link_ConfigRx(RF_RX_CHANNEL);
  g_rf_mode = 0;
#endif
  DebugPrint("RF Ready\r\n");
#endif
  
  /* 调试：确认TX固定时间 */
  DebugPrint("[SYNC] TX fixed at ");
  DebugPrintDec(SYNC_TX_TIME_MS);
  DebugPrint("ms, Window: ");
  DebugPrintDec(SYNC_TX_TIME_MS);
  DebugPrint("- ");
  DebugPrintDec(SYNC_TX_TIME_MS + 50U);
  DebugPrint("ms\r\n");





  /* 初始化同步数据 */
  g_cycle = 0;
  g_phase_ms = 0;
  g_last_tick_ms = HAL_GetTick();
  g_last_tx_cycle = (uint32_t)-1;

  g_led_state = 0;
  g_led_on_tick = 0;

  g_is_night = 1;
  g_last_daynight_tick = HAL_GetTick();
  g_daynight_hold_until_tick = 0;  /* 0=未在确认中，非0=满足条件后需持续到该 tick 才翻转 */

  g_last_charge_tick = HAL_GetTick();

  g_rf_sleeping = 0;
  g_rf_sleeping_night = 0;

#if APP_ROLE_RX_ONLY
  /* 按说明书对齐：RX 上电后自动进入 5 秒对码窗口（无需按键） */
  g_pairing_mode = 1U;
  g_pairing_enter_tick = HAL_GetTick();
  DebugPrint("[PAIR] auto enter (rx, 5s window)\r\n");
#endif

#if DEBUG_ADC_VERBOSE
  DebugPrint("[ADC] disabled in this project branch\r\n");
#endif

      /* 看门狗：暂时禁用，后续再解决 */
  // MX_IWDG_Init();
  // 
  // /* 等待看门狗计数器超过窗口值（3072），确保第一次喂狗在窗口内 */
  // HAL_Delay(100);  /* 100ms 足够让计数器超过 3072（32.7s * 3072/4095 ≈ 24.5s 的 0.4%） */
  // 
  // /* 第一次喂狗，确保在窗口内 */
  // HAL_IWDG_Refresh(&hiwdg);
  // DebugPrint("[IWDG] First refresh OK\r\n");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
    while (1)
  {
    static uint8_t last_is_night = 1;  /* 积木6/7：日夜切换时处理 RF 与低功耗 */
    /* 积木8：喂狗 - 暂时禁用 */
    // HAL_IWDG_Refresh(&hiwdg);

    /* P1：串口命令入口（临时对码） */
    UartCmd_Poll();

#if APP_RF_LINK_TEST
      /* 直接做收发链路测试，跳过后续日夜/同步/低功耗逻辑 */
      uint32_t now = HAL_GetTick();

      /* P2：按键对码入口（L+R 长按） */
      KeyPairing_Poll(now);

      /* 对码窗口提示（TX/RX 都可用，且优先级高于普通提示） */
      PairingLed_Update(now);

#if APP_ROLE_TX_ONLY
      /* 三键语义：主循环按状态机识别单击/双击/长按并更新 mode/brightness */
      TxKeys_Process(now);

#if TX_KEY_R_DEBUG_ONLY
      /* 右键本地调试模式：仅做按键识别与 LED 反馈，不发送业务包 */
      TxKeyR_DebugLedTask(now);
#else
      if ((g_tx_boot_warm_done == 0U) && ((int32_t)(now - g_tx_boot_warm_until) >= 0)) {
        g_tx_boot_warm_done = 1U;
        if ((g_pairing_mode == 0U) && (g_tx_need_send == 0U) && (g_tx_burst_left == 0U)) {
          RF_Link_Sleep();
          g_tx_rf_awake = 0U;
          DebugPrint("[RF] TX sleep@boot_end\r\n");
        }
      }

      /* 事件触发发包：空闲睡眠，事件唤醒后短突发发送 */
      if ((g_pairing_mode != 0U) || (g_tx_burst_left > 0U) || (g_tx_need_send != 0U)) {
        uint32_t tx_itv = (g_pairing_mode != 0U) ? LINK_TX_PAIRING_INTERVAL_MS : LINK_TX_BURST_INTERVAL_MS;

        if (g_tx_rf_awake == 0U) {
          RF_Link_ConfigTx(RF_TX_CHANNEL);
          g_tx_rf_awake = 1U;
          g_tx_rf_wakeup_tick = now;
          DebugPrint("[RF] wake->tx\r\n");
        }

        if ((now - g_tx_rf_wakeup_tick) >= RF_TX_WAKEUP_SETTLE_MS) {
          if ((now - g_tx_last_send_tick) >= tx_itv) {
            g_tx_last_send_tick = now;

            BuildTempLightPacket(RF_TX_Buf, g_tx_mode, g_tx_bright, g_tx_last_key, g_tx_last_trig);
            if (RF_Link_Send(RF_TX_Buf, RF_PACKET_SIZE) == 0) {
              g_link_tx_ok++;
            } else {
              g_link_tx_fail++;
              DebugPrint("[TX-ERR] send fail\r\n");
            }

            g_tx_need_send = 0U;
            if (g_tx_burst_left > 0U) {
              g_tx_burst_left--;
            }
          }
        }
      } else {
        if (g_tx_rf_awake != 0U) {
          RF_Link_Sleep();
          g_tx_rf_awake = 0U;
          DebugPrint("[RF] sleep\r\n");
        }
      }

