Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
      /* LED 定时熄灭（对码期间不熄灭/不改灯效） */
      if ((g_led_state == 1) && (g_pairing_mode == 0U)) {
        if ((now - g_led_on_tick) >= TX_KEY_LED_ON_MS) {
          HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
          g_led_state = 0;
        }
      }
#endif

#elif APP_ROLE_RX_ONLY
#if RX_LOCAL_EFFECT_TEST
      static uint32_t rx_local_mark = 0U;
      static uint8_t rx_local_idx = 0U;
      static const uint8_t rx_local_modes[4] = {4U, 5U, 6U, 7U};

      if ((now - rx_local_mark) >= RX_LOCAL_STEP_MS) {
        rx_local_mark = now;
        g_light_mode = rx_local_modes[rx_local_idx];
        g_light_bright = RX_LOCAL_TEST_BRIGHT;
        rx_local_idx++;
        if (rx_local_idx >= 4U) {
          rx_local_idx = 0U;
        }
        DebugPrint("[RX-LOCAL] mode=");
        DebugPrintDec((uint16_t)g_light_mode);
        DebugPrint(" bright=");
        DebugPrintDec((uint16_t)g_light_bright);
        DebugPrint("\r\n");
      }
#else
      /* RX-only：轮询接收 */
      uint8_t rx_len = 0;
      static uint8_t cur_mode = TLIGHT_MODE_MIN;
      static uint8_t cur_bright = TLIGHT_BRIGHT_30;
      static uint8_t cur_key = TLIGHT_KEY_NONE;
      static uint8_t cur_trig = TLIGHT_TRIG_NONE;
      static uint8_t last_print_mode = 0xFF;
      static uint8_t last_print_bright = 0xFF;
      static uint8_t last_print_key = 0xFF;
      static uint8_t last_print_trig = 0xFF;

      if (RF_Link_PollReceive(RF_RX_Buf, &rx_len) == 1) {
        uint8_t mode = 0;
        uint8_t bright = 0;

        /* 正式对码流程：进入对码模式后，捕获首个合法包中的 device_id 并持久化 */
        if (g_pairing_mode != 0U) {
          if ((RF_RX_Buf[0] == TLIGHT_PKT_HEADER0) &&
              (RF_RX_Buf[1] == TLIGHT_PKT_HEADER1) &&
              (RF_RX_Buf[TLIGHT_PKT_TAG_IDX] == TLIGHT_PKT_TAG_CONST) &&
              (RF_RX_Buf[TLIGHT_PKT_CHKSUM_IDX] == TempLight_CalcChecksum(RF_RX_Buf)) &&
              (RF_RX_Buf[2] >= TLIGHT_MODE_OFF) && (RF_RX_Buf[2] <= TLIGHT_MODE_MAX) &&
              (RF_RX_Buf[3] <= TLIGHT_BRIGHT_100)) {
            uint16_t new_pair_id = (uint16_t)((RF_RX_Buf[TLIGHT_PKT_DEV_ID_H_IDX] << 8) | RF_RX_Buf[TLIGHT_PKT_DEV_ID_L_IDX]);
            if (new_pair_id != TLIGHT_DEVICE_ID_INVALID) {
              if (DevId_SaveToFlash(g_dev_id_local, new_pair_id)) {
                g_pairing_mode = 0U;
                g_pairing_enter_tick = 0U;
                DebugPrint("[PAIR] success id=");
                DebugPrintHex((const uint8_t *)&new_pair_id, 2);
                DebugPrint("\r\n");
                PairingLed_Feedback(1U);
              } else {
                DebugPrint("[PAIR-ERR] flash save fail\r\n");
                PairingLed_Feedback(0U);
              }
            }
          }
        }

        if (ParseTempLightPacket(RF_RX_Buf, &mode, &bright, &cur_key, &cur_trig)) {
          uint8_t seq = (uint8_t)(RF_RX_Buf[TLIGHT_PKT_KEYTRIG_IDX] & 0x0FU);

          g_link_rx_ok++;
          g_link_last_rx_tick = now;
          g_link_timeout_flag = 0;

          if (g_link_has_last_seq) {
            uint8_t delta = (uint8_t)((seq - g_link_last_rx_seq) & 0x0FU);
            if (delta == 0U) {
              g_link_rx_dup++;
            } else if (delta > 1U) {
              g_link_rx_jump++;
              DebugPrint("[RX-WARN] seq_jump prev=");
              DebugPrintDec((uint16_t)g_link_last_rx_seq);
              DebugPrint(" now=");
              DebugPrintDec((uint16_t)seq);
              DebugPrint("\r\n");
            }
          }
          g_link_last_rx_seq = seq;
          g_link_has_last_seq = 1;

          cur_mode = mode;
          cur_bright = bright;
          g_light_mode = cur_mode;
          g_light_bright = cur_bright;

          if(cur_mode != last_print_mode || cur_bright != last_print_bright || cur_key != last_print_key || cur_trig != last_print_trig) {
            DebugPrint("[RX] mode=");
            DebugPrintDec((uint16_t)cur_mode);
            DebugPrint(" bright=");
            DebugPrintDec((uint16_t)cur_bright);
            DebugPrint(" key=");
            DebugPrintDec((uint16_t)cur_key);
            DebugPrint(" trig=");
            DebugPrintDec((uint16_t)cur_trig);
            DebugPrint(" seq=");
            DebugPrintDec((uint16_t)seq);
            DebugPrint(" (30/70/100)\r\n");
            last_print_mode = cur_mode;
            last_print_bright = cur_bright;
            last_print_key = cur_key;
            last_print_trig = cur_trig;
          }
        } else {
          if ((RF_RX_Buf[0] == TLIGHT_PKT_HEADER0) &&
              (RF_RX_Buf[1] == TLIGHT_PKT_HEADER1) &&
              (RF_RX_Buf[TLIGHT_PKT_TAG_IDX] == TLIGHT_PKT_TAG_CONST) &&
              (RF_RX_Buf[TLIGHT_PKT_CHKSUM_IDX] == TempLight_CalcChecksum(RF_RX_Buf)) &&
              (((uint16_t)((RF_RX_Buf[TLIGHT_PKT_DEV_ID_H_IDX] << 8) | RF_RX_Buf[TLIGHT_PKT_DEV_ID_L_IDX])) != g_dev_id_paired)) {
            g_link_rx_dev_mismatch++;
          } else {
            uint8_t hdr_ok = (uint8_t)((RF_RX_Buf[0] == TLIGHT_PKT_HEADER0) && (RF_RX_Buf[1] == TLIGHT_PKT_HEADER1));
            uint8_t mode_ok = (uint8_t)((RF_RX_Buf[2] >= TLIGHT_MODE_OFF) && (RF_RX_Buf[2] <= TLIGHT_MODE_MAX));
            uint8_t bright_ok = (uint8_t)(RF_RX_Buf[3] <= TLIGHT_BRIGHT_100);
            uint8_t key_ok = (uint8_t)(((RF_RX_Buf[TLIGHT_PKT_KEYTRIG_IDX] >> 6) & 0x03U) <= TLIGHT_KEY_NONE);
            uint8_t trig_ok = (uint8_t)(((RF_RX_Buf[TLIGHT_PKT_KEYTRIG_IDX] >> 4) & 0x03U) <= TLIGHT_TRIG_LONG);
            uint8_t tag_ok = (uint8_t)(RF_RX_Buf[TLIGHT_PKT_TAG_IDX] == TLIGHT_PKT_TAG_CONST);
            uint8_t chk_ok = (uint8_t)(RF_RX_Buf[TLIGHT_PKT_CHKSUM_IDX] == TempLight_CalcChecksum(RF_RX_Buf));

            g_link_rx_parse_err++;
            DebugPrint("[RX-ERR] bad packet h/m/b/k/t/g/c=");
            DebugPrintDec((uint16_t)hdr_ok);
            DebugPrint("/");
            DebugPrintDec((uint16_t)mode_ok);
            DebugPrint("/");
            DebugPrintDec((uint16_t)bright_ok);
            DebugPrint("/");
            DebugPrintDec((uint16_t)key_ok);
            DebugPrint("/");
            DebugPrintDec((uint16_t)trig_ok);
            DebugPrint("/");
            DebugPrintDec((uint16_t)tag_ok);
            DebugPrint("/");
            DebugPrintDec((uint16_t)chk_ok);
            DebugPrint("\r\n");
          }
        }
      }

