Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart1.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetTxFifoThreshold(&huart1, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetRxFifoThreshold(&huart1, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_DisableFifoMode(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, RF_CSN_Pin|RF_SCK_Pin|DIV_MOS_Pin|RF_DATA_Pin
                          |CHG_MOS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : L_KEY_Pin */
  GPIO_InitStruct.Pin = L_KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(L_KEY_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : M_KEY_Pin R_KEY_Pin */
  GPIO_InitStruct.Pin = M_KEY_Pin|R_KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : RF_CSN_Pin RF_SCK_Pin DIV_MOS_Pin RF_DATA_Pin
                           CHG_MOS_Pin */
  GPIO_InitStruct.Pin = RF_CSN_Pin|RF_SCK_Pin|DIV_MOS_Pin|RF_DATA_Pin
                          |CHG_MOS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : LED_Pin */
  GPIO_InitStruct.Pin = LED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */
  HAL_NVIC_SetPriority(EXTI0_1_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(EXTI0_1_IRQn);
  HAL_NVIC_SetPriority(EXTI4_15_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(EXTI4_15_IRQn);

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
/* ===== 双路 PWM 灯效输出（RX-only）===== */

static uint16_t Pwm_GetArrPlus1(void)
{
  uint32_t arr = __HAL_TIM_GET_AUTORELOAD(&htim1);
  if (arr > 0xFFFFU) arr = 0xFFFFU;
  return (uint16_t)(arr + 1U);
}

static uint16_t Bright_ToPulse(uint8_t bright)
{
  uint16_t arrp1 = Pwm_GetArrPlus1();
  uint32_t pct = 30U;
  if (bright == TLIGHT_BRIGHT_70) pct = 70U;
  else if (bright == TLIGHT_BRIGHT_100) pct = 100U;
  return (uint16_t)((arrp1 * pct) / 100U);
}

static void Pwm_Set(uint16_t ch3_pulse, uint16_t ch4_pulse)
{
  uint16_t arrp1 = Pwm_GetArrPlus1();
  if (ch3_pulse > arrp1) ch3_pulse = arrp1;
  if (ch4_pulse > arrp1) ch4_pulse = arrp1;
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, ch3_pulse);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, ch4_pulse);
}

static void PairingLed_Update(uint32_t now)
{
  if (g_pairing_mode == 0U) {
    return;
  }

  /* 对码窗口期间：LED 由对码逻辑独占，普通短亮提示不允许抢占 */
  g_led_state = 0;

  if ((now - g_pair_led_tick) >= 200U) {
    g_pair_led_tick = now;
    HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
  }
}

static void PairingLed_Feedback(uint8_t success)
{
  uint8_t i = 0;

  /* 反馈期间关闭普通短亮状态，防止抢占 */
  g_led_state = 0;

  if (success != 0U) {
    /* 成功：闪 3 次 */
    for (i = 0; i < 3U; i++) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
      HAL_Delay(120);
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      HAL_Delay(120);
    }
  } else {
    /* 失败/超时：长亮 1000ms */
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    HAL_Delay(1000);
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
  }
}

static uint8_t TxKey_ReadRaw(uint16_t pin, GPIO_TypeDef *port)
{
  return (HAL_GPIO_ReadPin(port, pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;
}

static uint8_t TxKey_Update(TxKeyState_t *ks, uint8_t raw, uint32_t now, uint8_t *evt_single, uint8_t *evt_double, uint8_t *evt_long)
{
  uint8_t changed = 0U;
  *evt_single = 0U;
  *evt_double = 0U;
  *evt_long = 0U;

  if (raw != ks->last_raw) {
    ks->last_raw = raw;
    ks->raw_change_tick = now;
  }

  if ((now - ks->raw_change_tick) >= KEY_DEBOUNCE_MS) {
    if (ks->stable_level != raw) {
      ks->stable_level = raw;
      changed = 1U;

      if (ks->stable_level != 0U) {
        /* 按下：记录开始时间，长按可在按住达到阈值立即触发 */
        ks->press_start_tick = now;
        ks->long_reported = 0U;
      } else {
        uint32_t press_dur = 0U;
        if (ks->press_start_tick != 0U) {
          press_dur = now - ks->press_start_tick;
        }
        ks->last_press_duration_ms = press_dur;

        /* 释放即短按：只要未触发长按就算单击 */
        if (ks->long_reported == 0U) {
          *evt_single = 1U;
        }

        ks->press_start_tick = 0U;
      }
    }
  }

  if ((ks->stable_level != 0U) && (ks->long_reported == 0U) && (ks->press_start_tick != 0U)) {
    if ((now - ks->press_start_tick) >= KEY_TX_LONG_MS) {
      ks->long_reported = 1U;
      *evt_long = 1U;
    }
  }

  (void)evt_double;
  return changed;
}

static uint16_t GetPhase1ms(uint16_t period_ms)
{
  uint16_t phase = g_phase_1ms;
  if (period_ms == 0U) return 0U;
  return (uint16_t)(phase % period_ms);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if (htim->Instance == TIM14) {
    g_phase_1ms++;
  }
}

static void Tx_ScheduleBurst(void)
{
  g_tx_need_send = 1U;
  if (g_tx_first_event_done == 0U) {
    g_tx_burst_left = LINK_TX_BOOT_BURST_COUNT;
    g_tx_first_event_done = 1U;
  } else {
    g_tx_burst_left = LINK_TX_EVENT_BURST_COUNT;
  }
}

static void Tx_DoOff(const char *key_name, const char *trig)
{
  g_tx_is_off = 1U;
  g_tx_in_effect = 0U;
  g_tx_mode = 0U;
  g_tx_left_all_on_armed = 0U;

  DebugPrint("[TX-OFF] key=");
  DebugPrint(key_name);
  DebugPrint(" trig=");
  DebugPrint(trig);
  DebugPrint("\r\n");
}

static void Tx_OnFromOff_BySingle(uint8_t key)
{
  g_tx_is_off = 0U;
  g_tx_last_key = key;
  g_tx_last_trig = TLIGHT_TRIG_SINGLE;

  if (key == TLIGHT_KEY_R) { /* 右键 */
    g_tx_in_effect = 1U;
    g_tx_effect_mode = 4U;
    g_tx_mode = g_tx_effect_mode;
    DebugPrint("[TX-ON] key=R trig=single to=effect1\r\n");
  } else {
    g_tx_in_effect = 0U;
    g_tx_basic_mode = 1U;
    g_tx_mode = g_tx_basic_mode;
    if (key == TLIGHT_KEY_L) {
      DebugPrint("[TX-ON] key=L trig=single to=basic1\r\n");
    } else {
      DebugPrint("[TX-ON] key=M trig=single to=basic1\r\n");
    }
  }
}

static void Tx_HandleSingle(uint8_t key)
{
  if (g_tx_is_off != 0U) {
    Tx_OnFromOff_BySingle(key);
    return;
  }

  g_tx_last_key = key;
  g_tx_last_trig = TLIGHT_TRIG_SINGLE;

