Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  if (key == TLIGHT_KEY_L) { /* 左键 */
    if (g_tx_in_effect != 0U) {
      g_tx_in_effect = 0U;
      g_tx_basic_mode = 1U;
      g_tx_mode = g_tx_basic_mode;
    } else {
      g_tx_basic_mode++;
      if (g_tx_basic_mode > 2U) g_tx_basic_mode = 1U;
      g_tx_mode = g_tx_basic_mode;
    }
  } else if (key == TLIGHT_KEY_M) { /* 中键 */
    g_tx_bright++;
    if (g_tx_bright > TLIGHT_BRIGHT_100) g_tx_bright = TLIGHT_BRIGHT_30;
  } else { /* 右键 */
    g_tx_in_effect = 1U;
    g_tx_effect_mode++;
    if (g_tx_effect_mode > 7U) g_tx_effect_mode = 4U;
    g_tx_mode = g_tx_effect_mode;
  }
}

static void Tx_HandleOffTrigger(uint8_t key, const char *trig)
{
  uint8_t trig_code = TLIGHT_TRIG_NONE;

  if (g_tx_is_off != 0U) {
    return;
  }

  if ((trig[0] == 'd') || (trig[0] == 'D')) {
    trig_code = TLIGHT_TRIG_DOUBLE;
  } else {
    trig_code = TLIGHT_TRIG_LONG;
  }

  if (key == TLIGHT_KEY_L) {
    if ((g_tx_mode != 3U) && (g_tx_left_all_on_armed == 0U)) {
      g_tx_in_effect = 0U;
      g_tx_basic_mode = 3U;
      g_tx_mode = 3U;
      g_tx_left_all_on_armed = 1U;
      g_tx_last_key = TLIGHT_KEY_L;
      g_tx_last_trig = trig_code;
      DebugPrint("[TX-KEY] key=L trig=");
      DebugPrint(trig);
      DebugPrint(" action=all_on\r\n");
      return;
    }
  }

  g_tx_last_key = key;
  g_tx_last_trig = trig_code;
  Tx_DoOff((key == TLIGHT_KEY_L) ? "L" : ((key == TLIGHT_KEY_M) ? "M" : "R"), trig);
}

static void TxKeys_Process(uint32_t now)
{
#if APP_ROLE_TX_ONLY
  uint8_t changed = 0U;
  uint8_t s = 0U, d = 0U, l = 0U;

#if TX_KEY_R_DEBUG_ONLY
  (void)TxKey_Update(&g_txk_r, TxKey_ReadRaw(R_KEY_Pin, R_KEY_GPIO_Port), now, &s, &d, &l);
  if (s) {
    g_rdbg_evt_single = 1U;
    g_rdbg_single_cnt++;
    DebugPrint("[RDBG] single cnt=");
    DebugPrintDec((uint16_t)(g_rdbg_single_cnt & 0xFFFFU));
    DebugPrint(" dur=");
    DebugPrintDec((uint16_t)g_txk_r.last_press_duration_ms);
    DebugPrint("ms\r\n");
  }
  if (d) {
    /* 当前阶段关闭双击业务：调试模式下仅记录忽略 */
    DebugPrint("[RDBG] double ignored\r\n");
  }
  if (l) {
    g_rdbg_evt_long = 1U;
    g_rdbg_long_cnt++;
    DebugPrint("[RDBG] long cnt=");
    DebugPrintDec((uint16_t)(g_rdbg_long_cnt & 0xFFFFU));
    DebugPrint(" hold>=");
    DebugPrintDec((uint16_t)KEY_TX_LONG_MS);
    DebugPrint("ms\r\n");
  }
#else
  (void)TxKey_Update(&g_txk_l, TxKey_ReadRaw(L_KEY_Pin, L_KEY_GPIO_Port), now, &s, &d, &l);
  (void)d;
  if (s) { g_tx_evt_l = 1U; }
  if (l) { Tx_HandleOffTrigger(0U, "long"); changed = 1U; }

  (void)TxKey_Update(&g_txk_m, TxKey_ReadRaw(M_KEY_Pin, M_KEY_GPIO_Port), now, &s, &d, &l);
  (void)d;
  if (s) { g_tx_evt_m = 1U; }
  if (l) { Tx_HandleOffTrigger(1U, "long"); changed = 1U; }

  (void)TxKey_Update(&g_txk_r, TxKey_ReadRaw(R_KEY_Pin, R_KEY_GPIO_Port), now, &s, &d, &l);
  (void)d;
  if (s) { g_tx_evt_r = 1U; }
  if (l) { Tx_HandleOffTrigger(2U, "long"); changed = 1U; }

  if (g_tx_evt_l != 0U) {
    g_tx_evt_l = 0U;
    Tx_HandleSingle(0U);
    changed = 1U;
  }

  if (g_tx_evt_m != 0U) {
    g_tx_evt_m = 0U;
    Tx_HandleSingle(1U);
    changed = 1U;
  }

  if (g_tx_evt_r != 0U) {
    g_tx_evt_r = 0U;
    Tx_HandleSingle(2U);
    changed = 1U;
  }

  if (changed != 0U) {
    Tx_ScheduleBurst();

    if (g_pairing_mode == 0U) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
      g_led_state = 1;
      g_led_on_tick = HAL_GetTick();
    }

    DebugPrint("[TX-KEY] mode=");
    DebugPrintDec((uint16_t)g_tx_mode);
    DebugPrint(" bright=");
    DebugPrintDec((uint16_t)g_tx_bright);
    DebugPrint(" key=");
    DebugPrintDec((uint16_t)g_tx_last_key);
    DebugPrint(" trig=");
    DebugPrintDec((uint16_t)g_tx_last_trig);
    DebugPrint(" off=");
    DebugPrintDec((uint16_t)g_tx_is_off);
    DebugPrint(" dev=");
    DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
    DebugPrint("\r\n");
  }
#endif
#else
  (void)now;
  /* RX 构建保持空实现 */
#endif
}

/* 非阻塞灯效状态机：只依赖 HAL_GetTick() */
static void TxKeyR_DebugLedTask(uint32_t now)
{
#if APP_ROLE_TX_ONLY && TX_KEY_R_DEBUG_ONLY
  if (g_rdbg_evt_double != 0U) {
    g_rdbg_evt_double = 0U;
    g_rdbg_evt_single = 0U;
    g_rdbg_led_state = RDBG_LED_DBL_HOLD;
    g_rdbg_led_mark = now;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    DebugPrint("[RDBG-LED] DOUBLE hold_on\r\n");
    return;
  }

  if (g_rdbg_evt_long != 0U) {
    g_rdbg_evt_long = 0U;
    g_rdbg_evt_single = 0U;
    g_rdbg_led_state = RDBG_LED_LONG_ON;
    g_rdbg_led_mark = now;
    g_rdbg_led_long_remain = 3U;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    DebugPrint("[RDBG-LED] LONG blink3_start\r\n");
    return;
  }

  if (g_rdbg_evt_single != 0U) {
    g_rdbg_evt_single = 0U;
    g_rdbg_led_state = RDBG_LED_SINGLE_ON;
    g_rdbg_led_mark = now;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    DebugPrint("[RDBG-LED] SINGLE blink1_start\r\n");
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_SINGLE_ON) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_STEP_MS) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_rdbg_led_state = RDBG_LED_IDLE;
      DebugPrint("[RDBG-LED] SINGLE done\r\n");
    }
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_DBL_HOLD) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_DBL_HOLD_MS) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_rdbg_led_state = RDBG_LED_IDLE;
    }
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_LONG_ON) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_STEP_MS) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_rdbg_led_mark = now;
      g_rdbg_led_state = RDBG_LED_LONG_OFF;
      /* pulse_off log disabled to reduce UART blocking */
    }
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_LONG_OFF) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_STEP_MS) {
      if (g_rdbg_led_long_remain > 1U) {
        g_rdbg_led_long_remain--;
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
        g_rdbg_led_mark = now;
        g_rdbg_led_state = RDBG_LED_LONG_ON;
        /* pulse_on log disabled to reduce UART blocking */
      } else {
        g_rdbg_led_long_remain = 0U;
        g_rdbg_led_state = RDBG_LED_IDLE;
        /* long done log disabled to reduce UART blocking */
      }
    }
    return;
  }

  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
#else
  (void)now;
#endif
}

/* 非阻塞灯效状态机：基于 TIM14 1ms 节拍相位锁定 */
static void Light_Tick(uint32_t now)
{
  const uint16_t base = Bright_ToPulse(g_light_bright);

  /* 对齐说明书参数：
   * mode4: 250ms亮+250ms灭（2Hz）
   * mode5: 远近各500ms交替
   * mode6: 2s呼吸周期
   * mode7: 远光250ms轮闪（仅CH3） */
  const uint16_t fast_ms = 250U;   /* mode4 */
  const uint16_t alt_ms  = 500U;   /* mode5 */
  const uint16_t wheel_ms = 250U;  /* mode7 */
  const uint16_t breath_ms = 2000U; /* mode6 */

  (void)now;

