Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  switch (g_light_mode) {
    case 1: /* 近光：CH4 */
      Pwm_Set(0U, base);
      break;

    case 2: /* 远光：CH3 */
      Pwm_Set(base, 0U);
      break;

    case 3: /* 远近同亮 */
      Pwm_Set(base, base);
      break;

    case 4: /* 远光同步快闪：相位锁定 */
    {
      uint16_t phase = GetPhase1ms((uint16_t)(fast_ms * 2U));
      Pwm_Set((phase < fast_ms) ? base : 0U, 0U);
      break;
    }

    case 5: /* 远近交替闪：相位锁定 + 1ms死区避免跨通道重叠毛刺 */
    {
      uint16_t phase = GetPhase1ms((uint16_t)(alt_ms * 2U));
      if (phase < (alt_ms - 1U)) {
        Pwm_Set(base, 0U);
      } else if (phase < alt_ms) {
        Pwm_Set(0U, 0U);
      } else if (phase < ((uint16_t)(alt_ms * 2U) - 1U)) {
        Pwm_Set(0U, base);
      } else {
        Pwm_Set(0U, 0U);
      }
      break;
    }

    case 6: /* 近光呼吸（三角波，相位锁定） */
    {
      uint16_t phase = GetPhase1ms(breath_ms);
      uint16_t half = (uint16_t)(breath_ms / 2U);
      uint16_t tri = (phase < half) ? phase : (uint16_t)(breath_ms - phase);
      uint16_t pulse = (uint16_t)(((uint32_t)base * (uint32_t)tri) / (uint32_t)half);
      Pwm_Set(0U, pulse);
      break;
    }

    case 7: /* 远光轮闪（仅CH3）：相位锁定 */
    {
      uint16_t phase = GetPhase1ms((uint16_t)(wheel_ms * 2U));
      Pwm_Set((phase < wheel_ms) ? base : 0U, 0U);
      break;
    }

    default:
      Pwm_Set(0U, 0U);
      break;
  }
}

static void DebugPrint(const char *s)
{
#if UART_LOG_ENABLE
  HAL_UART_Transmit(&huart1, (uint8_t*)s, strlen(s), 100);
#else
  (void)s;
#endif
}

static void DebugPrintHex(const uint8_t *buf, uint8_t len)
{
#if UART_LOG_ENABLE
  char hex[3];
  uint8_t i;
  for(i = 0; i < len; i++) {
    sprintf(hex, "%02X", buf[i]);
    HAL_UART_Transmit(&huart1, (uint8_t*)hex, 2, 100);
  }
#else
  (void)buf;
  (void)len;
#endif
}

static void DebugPrintDec(uint16_t val)
{
#if UART_LOG_ENABLE
  char buf[6];
  sprintf(buf, "%u", val);
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 100);
#else
  (void)val;
#endif
}


/**
 * @brief  更新本地时钟相位基准，积木5：周期边界时启动 LED PWM
 *         使用 HAL_GetTick 的时间差，滚动更新 g_phase_ms
 */
static void SyncTime_Update(void)
{
  uint32_t now = HAL_GetTick();
  uint32_t delta = now - g_last_tick_ms;
  if(delta == 0) return;
  g_last_tick_ms = now;

  uint32_t total = g_phase_ms + delta;
  uint32_t new_cycles = total / SYNC_CYCLE_MS;
  g_cycle += new_cycles;
  g_phase_ms = (uint16_t)(total % SYNC_CYCLE_MS);

        /* 周期边界：跨越 0ms 时立即点亮 LED（PWM 124kHz 60%），积木4 */
  if(new_cycles > 0) {
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    g_led_on_tick = now;
    g_led_state = 1;
    #if DEBUG_SYNC_VERBOSE
    DebugPrint("[CYCLE] new_cycle=");
    DebugPrintDec(g_cycle);
    DebugPrint(", phase_reset=0ms\r\n");
#endif
#if DEBUG_LED_VERBOSE
    DebugPrint("[LED] CYCLE @0\r\n");
#endif
  }
}

/**
 * @brief  同步闪灯：时间戳保证至少亮 100ms 后熄灭，积木4/5
 *         LED_DRV(PA2) 用 TIM1_CH3 PWM，PB6 状态指示
 */
static void SyncLamp_Update(void)
{
  uint32_t now = HAL_GetTick();

  if(g_led_state == 1) {
    if((now - g_led_on_tick) >= SYNC_LED_ON_MS) {
      HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_3);
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_led_state = 0;
      #if DEBUG_LED_VERBOSE
      DebugPrint("[LED] OFF\r\n");
#endif
    }
  }
  /* 注释：移除补亮逻辑，LED只在周期边界点亮 */
  /* 这样确保每个周期只点亮一次，持续100ms */
}

/* 构造同步包，积木8：传输延迟补偿 6ms */
static void BuildSyncPacket(uint8_t *pkt)
{
  uint16_t compensated = g_phase_ms + SYNC_TX_DELAY_MS;
  if(compensated >= SYNC_CYCLE_MS) compensated -= SYNC_CYCLE_MS;

  pkt[0] = 0xAA;
  pkt[1] = 0x55;
  pkt[2] = (uint8_t)(compensated >> 8);
  pkt[3] = (uint8_t)(compensated & 0xFF);
}

static uint16_t ParseSyncPacket(const uint8_t *pkt)
{
  if(pkt[0] != 0xAA || pkt[1] != 0x55) return 0xFFFF;
  return (uint16_t)((pkt[2] << 8) | pkt[3]);
}

/* 临时灯光控制包构造：先占位业务字段（后面替换成你们真正协议） */
static uint8_t TempLight_CalcChecksum(const uint8_t *pkt)
{
  uint8_t x = 0;
  x ^= pkt[0];
  x ^= pkt[1];
  x ^= pkt[2];
  x ^= pkt[3];
  x ^= pkt[TLIGHT_PKT_KEYTRIG_IDX];
  x ^= pkt[TLIGHT_PKT_DEV_ID_L_IDX];
  x ^= pkt[TLIGHT_PKT_DEV_ID_H_IDX];
  x ^= pkt[TLIGHT_PKT_TAG_IDX];
  return x;
}

static void BuildTempLightPacket(uint8_t *pkt, uint8_t mode, uint8_t bright, uint8_t key, uint8_t trig)
{
  uint8_t seq4 = (uint8_t)(g_link_tx_seq & 0x0FU);
  if (key > TLIGHT_KEY_NONE) key = TLIGHT_KEY_NONE;
  if (trig > TLIGHT_TRIG_LONG) trig = TLIGHT_TRIG_NONE;

  pkt[0] = TLIGHT_PKT_HEADER0;
  pkt[1] = TLIGHT_PKT_HEADER1;
  pkt[2] = mode;
  pkt[3] = bright;
  pkt[TLIGHT_PKT_KEYTRIG_IDX] = (uint8_t)(((key & 0x03U) << 6) | ((trig & 0x03U) << 4) | seq4);
  pkt[TLIGHT_PKT_DEV_ID_L_IDX] = (uint8_t)(g_dev_id_local & 0xFFU);
  pkt[TLIGHT_PKT_DEV_ID_H_IDX] = (uint8_t)(g_dev_id_local >> 8);
  pkt[TLIGHT_PKT_TAG_IDX] = TLIGHT_PKT_TAG_CONST;
  pkt[TLIGHT_PKT_CHKSUM_IDX] = TempLight_CalcChecksum(pkt);

  g_link_tx_seq++;
}

/* 解析临时灯光控制包：返回 1=合法，否则 0 */
static uint8_t ParseTempLightPacket(const uint8_t *pkt, uint8_t *mode, uint8_t *bright, uint8_t *key, uint8_t *trig)
{
  uint16_t pkt_id = (uint16_t)((pkt[TLIGHT_PKT_DEV_ID_H_IDX] << 8) | pkt[TLIGHT_PKT_DEV_ID_L_IDX]);
  uint8_t key_raw = (uint8_t)((pkt[TLIGHT_PKT_KEYTRIG_IDX] >> 6) & 0x03U);
  uint8_t trig_raw = (uint8_t)((pkt[TLIGHT_PKT_KEYTRIG_IDX] >> 4) & 0x03U);

  if(pkt[0] != TLIGHT_PKT_HEADER0 || pkt[1] != TLIGHT_PKT_HEADER1) return 0;
  if(pkt[2] < TLIGHT_MODE_OFF || pkt[2] > TLIGHT_MODE_MAX) return 0;
  if(pkt[3] > TLIGHT_BRIGHT_100) return 0;
  if(key_raw > TLIGHT_KEY_NONE) return 0;
  if(trig_raw > TLIGHT_TRIG_LONG) return 0;
  if(pkt_id != g_dev_id_paired) return 0;
  if(pkt[TLIGHT_PKT_TAG_IDX] != TLIGHT_PKT_TAG_CONST) return 0;
  if(pkt[TLIGHT_PKT_CHKSUM_IDX] != TempLight_CalcChecksum(pkt)) return 0;

  *mode = pkt[2];
  *bright = pkt[3];
  *key = key_raw;
  *trig = trig_raw;
  return 1;
}

static void LinkStats_Log(uint32_t now)
{
  if ((now - g_link_last_stats_tick) < LINK_STATS_LOG_INTERVAL_MS) {
    return;
  }
  g_link_last_stats_tick = now;

#if APP_ROLE_TX_ONLY
  if ((g_link_tx_ok == 0U) && (g_link_tx_fail == 0U) && (g_pairing_mode == 0U)) {
    return;
  }

  if ((g_link_tx_ok == g_link_last_log_tx_ok) &&
      (g_link_tx_fail == g_link_last_log_tx_fail) &&
      (g_tx_rf_awake == g_link_last_log_tx_awake) &&
      (g_pairing_mode == 0U)) {
    return;
  }

  g_link_last_log_tx_ok = g_link_tx_ok;
  g_link_last_log_tx_fail = g_link_tx_fail;
  g_link_last_log_tx_awake = g_tx_rf_awake;

  DebugPrint("[TX-STAT] ok=");
  DebugPrintDec((uint16_t)(g_link_tx_ok & 0xFFFFU));
  DebugPrint(" fail=");
  DebugPrintDec((uint16_t)(g_link_tx_fail & 0xFFFFU));
  DebugPrint(" seq=");
  DebugPrintDec((uint16_t)g_link_tx_seq);
  DebugPrint(" awake=");
  DebugPrintDec((uint16_t)g_tx_rf_awake);
  DebugPrint(" dev=");
  DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
  DebugPrint("\r\n");
#elif APP_ROLE_RX_ONLY
  DebugPrint("[RX-STAT] ok=");
  DebugPrintDec((uint16_t)(g_link_rx_ok & 0xFFFFU));
  DebugPrint(" parse_err=");
  DebugPrintDec((uint16_t)(g_link_rx_parse_err & 0xFFFFU));
  DebugPrint(" dev_miss=");
  DebugPrintDec((uint16_t)(g_link_rx_dev_mismatch & 0xFFFFU));
  DebugPrint(" dup=");
  DebugPrintDec((uint16_t)(g_link_rx_dup & 0xFFFFU));
  DebugPrint(" jump=");
  DebugPrintDec((uint16_t)(g_link_rx_jump & 0xFFFFU));
  DebugPrint("\r\n");
#endif
}

static void Sync_AdjustFromPacket(uint16_t rx_phase_ms)
{
  int16_t delta = (int16_t)rx_phase_ms - (int16_t)g_phase_ms;
  if(delta > (int16_t)(SYNC_CYCLE_MS / 2)) delta -= SYNC_CYCLE_MS;
  if(delta < -(int16_t)(SYNC_CYCLE_MS / 2)) delta += SYNC_CYCLE_MS;
  
  #if DEBUG_SYNC_VERBOSE
  /* 调试：显示调整前的详细信息 */
  DebugPrint("[ADJ] rx=");
  DebugPrintDec(rx_phase_ms);
  DebugPrint(" local=");
  DebugPrintDec(g_phase_ms);
  DebugPrint(" delta=");
  if(delta >= 0) {
    DebugPrint("+");
    DebugPrintDec((uint16_t)delta);
  } else {
    DebugPrint("-");
    DebugPrintDec((uint16_t)(-delta));
  }
  DebugPrint(" adjust=");
  DebugPrintDec((uint16_t)(delta / 4));
  DebugPrint("ms\r\n");
#endif

  g_phase_ms = (uint16_t)((int16_t)g_phase_ms + delta / 4);
  if(g_phase_ms >= SYNC_CYCLE_MS) g_phase_ms -= SYNC_CYCLE_MS;
}

/**
 * @brief  同步主状态机：TX@450ms固定时间发送，450-900ms全程RX侦听
 *         相邻频道策略（TX@76, RX@75）避免自干扰和碰撞
 */
static void Sync_MainLoop(void)
{
  /* 更新本地时间基准（增量式） */
  SyncTime_Update();
  /* 驱动 LED 指示灯（100ms 保持亮，然后熄灭） */
  SyncLamp_Update();

  /* 固定 TX 时间段：所有节点同一时刻发送，确保相位对齐 */
  if (g_cycle != g_last_tx_cycle && g_phase_ms >= SYNC_TX_TIME_MS && g_phase_ms < (SYNC_TX_TIME_MS + 50U)) {
    /* 切换到 TX 模式，频道 76 */
    if (g_rf_mode != 1) {
      RF_Link_ConfigTx(RF_TX_CHANNEL);
      g_rf_mode = 1;
    }

        /* 构造并发送同步包 */
    BuildSyncPacket(RF_TX_Buf);
        if (RF_Link_Send(RF_TX_Buf, SYNC_PKT_SIZE) == 0) {
#if DEBUG_SYNC_VERBOSE
      DebugPrint("[TX] phase=");
      DebugPrintDec(g_phase_ms);
      DebugPrint("ms, target=");
      DebugPrintDec(SYNC_TX_TIME_MS);
      DebugPrint("ms, diff=");
      if(g_phase_ms >= SYNC_TX_TIME_MS) {
        DebugPrint("+");
        DebugPrintDec(g_phase_ms - SYNC_TX_TIME_MS);
      } else {
        DebugPrint("-");
        DebugPrintDec(SYNC_TX_TIME_MS - g_phase_ms);
      }
      DebugPrint("ms\r\n");
#else
      DebugPrint("[TX]\r\n");
#endif
    }
    g_last_tx_cycle = g_cycle;

